Revit 2024 API
BuiltInFailures.MEPCalculationFailures.NetworkErrorExtractCurveData Property
 The calculation could not be performed. Verify the pump curve data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NetworkErrorExtractCurveData { get; }
Visual Basic
Public Shared ReadOnly Property NetworkErrorExtractCurveData As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NetworkErrorExtractCurveData {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace